Repository: 1m4ngry/they-db
Catalog: debian/po/*.po
Languages: ca, da, es, fr, ja, nl, ru

source: Do you want man and mandb to be installed setuid man?
ca: Voleu que man i mandb s'instal·len setuid man?
da: Vil du have, at man og mandb bliver installeret 'setuid man'?
es: ¿Quiere que man y man-db se instalen setuid man?
fr: Voulez-vous installer les programmes man et mandb pour l'utilisateur « man » ?
ja: man と mandb を setuid man な状態でインストールしますか?
nl: Wilt u man en mandb installeren met setuid man?
ru: Вы хотите установить setuid man для man и mandb?

source: The man and mandb program can be installed with the set-user-id bit set, so that they will run with the permissions of the 'man' user. This allows ordinary users to benefit from the caching of preformatted manual pages ('cat pages'), and means that the database of man page descriptions is automatically kept up to date by people reading man pages. Storing cat pages, in particular, may aid performance on slower machines.
ca: Els programes man i mandb poden ser instal·lats amb el bit set-user-id establert per a que aquests s'executin amb els permissos de l'usuari "man". Això permetrà als usuaris ordinaris beneficiar-se des de la memòria cau del preformatejat de les pàgines de manual ("cat pages") i significa que la base de dades de les descripcions de les pàgines de manual són automàticament actualitzades per la gent que les llegeix. En particular, l'emmagatzemament de pàgines cat pot ajudar el rendiment en màquines lentes.
da: Programmerne man og mandb kan blive installeret med sæt-bruger-ID sat, så de vil blive kørt med brugeren 'man's rettigheder. Det gør det muligt for almindelige brugere at benytte præformaterede manualsider ('cat-sider') fra mellemlageret, og betyder at databasen over manualsidebeskrivelser automatisk holdes opdateret, når folk læser manualsiderne. Især kan cat-sider kan gøre visningen hurtigere på langsomme maskiner.
es: Los programas man y mandb se pueden instalar setuid man, de forma que se ejecutarán con los permisos del usuario 'man'. Esto permite a los usuarios normales beneficiarse del caché de las páginas de manual preformateadas ('cat pages'), y significa que la base de datos de las descripciones de páginas de manual se mantiene actualizada gracias a la lectura de páginas de manual por los usuarios. Este sistema puede ayudar particularmente a mejorar el rendimiento en máquinas lentas.
fr: On peut positionner le bit « set-user-id » des programmes man et mandb de manière qu'ils s'exécutent avec les droits de l'utilisateur « man ». Les utilisateurs ordinaires peuvent ainsi bénéficier du cache des pages de manuel pré-formatées (« catpage ») ; cela permet aussi que la base de données des descriptions de page soit maintenue à jour par ceux qui lisent le manuel. Le cache des pages peut aussi améliorer les performances des machines lentes.
ja: man プログラムと mandb プログラムは、「man」ユーザの権限恩恵を受ける ために、set-user-id ビットをセットした状態でインストールすることがで きます。そうすると、通常のユーザがフォーマット済みのマニュアルページ (「cat ページ」) のキャッシングを使うことができ、マニュアルページの記 述が、それを読む人によって、自動的に更新されます。特に、遅いマシンで は、cat ページを保存しておくと、パフォーマンスの向上に役立ちます。
nl: De man en mandb programma's kunnen geinstalleerd worden met de set-user-id bit ingesteld zodat ze uitgevoerd worden als de gebruiker 'man'. Dit geeft gewone gebruikers de gelegenheid om van de tijdelijke opslag van voorgegeformatteerde handleiding pagina's ('cat pages') gebruik te maken. Dit betekent ook dat de database met man-pagina beschrijvingen automatisch aktueel gehouden wordt door de gebruikers die man-pagina's lezen. Het opslaan van cat-pagina's in het bijzonder kan de prestaties op tragere systemen helpen.
ru: Программы man и mandb могут быть установлены с установленным битом set-user-id, чтобы они запускались с правами пользователя 'man'. Это позволит обычным пользователям пользоваться кешированными отформатированными страницами руководств ('cat pages'), и означает, что база данных описаний страниц руководств будет автоматически обновляться людьми, просматривающими страницы руководств. Хранение cat страниц снижает требования к производительности, что особенно важно для старых машин.

source: Cached man pages only work if you are using a "normal"-width terminal (66 to 80 characters wide). This is to avoid one user causing cat pages to be saved at widths that would be inconvenient for other users. In a future release this will be configurable. Until then, if you use a wide terminal, you can force man pages to be formatted to 80 characters anyway by setting MANWIDTH=80.
ca: La memòria cau de les pàgines de manual sols funciona si useu un terminal d'amplada "normal" (de 66 a 80 caràcters). Això és així per a evitar el que un usuari faci pàgines cat que siguin desades en una amplada que puga ser inconvenient per a d'altres usuaris. En futures versions això es podrà configurar. Fins llavors, si useu un terminal ample, podeu forçar el preformatejat a 80 caràcters de les pàgines de manual establint MANWIDTH=80.
da: Gemte manualsider vil kun virke, hvis du bruger hvis du bruger en terminal med "normal" bredde (66 til 80 karakterer). Dette er for at undgå, at en bruger får manualsider gemt med en bredde der vil være gene for andre brugere. I en fremtidig udgave vil dette være konfigurerbart. Indtil da, kan du, hvis du bruger en 'bred' terminal, tvinge manualsider til at blive formateret til 80 karakter alligevel ved at sætte MANWIDTH=80.
es: El caché de las páginas de manual preformateadas sólo funciona si está usando un terminal de anchura "normal" (entre 66 y 80 caracteres de ancho). La razón de ser de este comportamiento es evitar que algún usuario guarde páginas de manual preformateadas con anchuras que puedan resultar molestas para otros usuarios. Las versiones futuras de este paquete serán configurables; hasta entonces, si usa un terminal ancho, puede obligar a formatear a 80 caracteres estableciendo MANWIDTH=80 como variable de entorno.
fr: Il faut utiliser un terminal d'une largeur « normale » (de 66 à 80 caractères par ligne) pour que le cache des pages fonctionne. On évite ainsi qu'un utilisateur ne cache des pages dans un format inutilisable par un autre utilisateur. En attendant une version où l'on pourra choisir une largeur, vous pouvez, si vous utilisez un grand écran, formater les pages pour 80 caractères avec le paramètre MANWIDTH=80.
ja: キャッシングされたマニュアルページは、「通常」幅のターミナル (66 文字 から 80 文字) を使っている時のみ、使えます。これによって、他のユーザ にとって不便な幅に整形されたページが保存されてしまうのを防ぐことがで きます。将来、これは設定可能となります。それまでは、幅の広いターミナ ルを使っている場合、MANWIDTH=80 と設定することでマニュアルページが 80 文字で整形されるように強制する必要があります。
nl: Tijdelijk opgeslagen man-pagina's werken enkel wanneer u een "normale"-breedte terminal (66 tot 80 karakters breed) gebruikt. Dit vermijdt dat één gebruiker cat-pagina's opslaat met breedtes die niet geschikt zijn voor andere gebruikers. In toekomstige versies zal dit instelbaar zijn. Tot dan kunt u het weergeven van man-pagina's, op bredere terminals, met een breedte van 80 karakters afdwingen door het instellen van MANWIDTH=80.
ru: Кешированные страницы руководств работают только если вы используете терминал с "обычной" нириной экрана (от 66 до 80 симолов в строке). Это избавляет от сохранения в кеше страниц одного из пользователей с форматом, несовместимым с другими пользователями. В будущем выпуске это будет настраиваться. Сейчас, если вы используете широкий терминал, то можете принудительно форматировать страницы по 80 символов в строке установкой MANWIDTH=80.

source: Enabling this feature may be a security risk, so it is disabled by default. If in doubt, I suggest you leave it disabled.
ca: Habilitar aquesta característica pot causar un risc de seguretat, pel que per defecte està deshabilitat. Si teniu cap dubte, vos suggerim que ho deshabiliteu.
da: At slå denne funktion til kan være en sikkerheds-risiko, derfor er den som standard slået fra. Hvis du er i tvivl, foreslår jeg at du lader den være slået fra.
es: Esta práctica puede representar un riesgo de seguridad, por lo que está deshabilitada por defecto. Si tiene dudas, le sugiero que la deje sin habilitar.
fr: Cette fonctionnalité peut comporter un risque pour la sécurité du système ; elle n'est pas installée par défaut. Si vous avez un doute, je vous propose de faire de même.
ja: セキュリティ上の問題があるかも知れないので、この機能はデフォルトでは 無効となっています。分からなければ、無効のままにしておくのをおすすめ します。
nl: Het activeren van deze optie kan een veiligheidsrisico zijn; daarom staat deze optie standaard uit. Bij twijfel kunt u deze optie best uit laten.
ru: Включение этой возможности является угрозой бещопасности, поэтому по умолчанию она выключена. Если не знаете, что делать, то оставьте как есть.

source: Should mandb build its database now?
ca: Hauria de construir ara mandb la seva base de dades?
da: Skal mandb opbygge sin database nu?
es: ¿Quiere que mandb construya su base de datos ahora?
fr: Voulez-vous construire la base de données maintenant ?
ja: mandb は、いまデータベースを構築すべきですか?
nl: mandb-database nu opbouwen?
ru: Построить базу данных mandb сейчас?

source: You do not yet have a database of manual page descriptions. Building one may take some time, depending on how many pages you have installed; it will happen in the background, possibly slowing down the installation of other packages. Do you want this to happen now?
ca: Encara no teniu una base de dades de les descripcions de les pàgines de manual. El construir-ne una pot trigar una estona, depenent de quantes pàgines de manual tingueu instal·lades; això es farà en segon pla i possiblement alentirà la instal·lació d'altres paquets. Voleu que es faci això ara?
da: Du har endnu ingen database over manualsidebeskrivelser. Det vil tage nogen tid at opbygge en sådan, afhængigt af, hvor mange manualsider, du har installeret. Det vil ske i baggrunden, og kan midlertidigt gøre installationen af andre pakker langsommere. Vil du have, at det sker nu?
es: Todavía no tiene una base de datos de descripciones de páginas de manual. Construir una puede llevar algún tiempo, dependiendo de cuántas páginas de manual haya instalado; se realizará en segundo plano, por lo que es posible que haga más lenta la instalación de otros paquetes. ¿Quiere hacerlo ahora?
fr: Aucune base de données des pages de manuel n'existe encore. Selon le nombre de pages installées, cela peut prendre du temps ; cela se passe en arrière-plan et cela peut ralentir l'installation des autres paquets. Voulez-vous lancer maintenant le programme mandb ?
ja: マニュアルページの記述のデータベースがまだありません。どれだけのマニ ュアルページをインストールしたかに依存して、この構築には多少の時間が かかります。構築はバックグラウンドで行いますので、他のパッケージのイ ンストール過程が遅くなるかもしれません。いま構築したいですか?
nl: U heeft nog geen man-pagina-beschrijvingsdatabase. Het opbouwen van deze database kan enige tijd duren, afhankelijk van hoeveel man-pagina's u geïnstalleerd heeft; dit gebeurt in de achtergrond en kan de installatie van andere pakketten vertragen. Wilt u dat dit nu gebeurt?
ru: У вас пока нет базы данных описаний страниц руководств. Ее создание может занять некоторое время, в зависимости от количества установленных страниц руководств; создание базы производится в фоновом процессе, что может замедлить установку остальных пакетов. Вас это устраивает?

source: If you do not build the database now, it will be built the next time /etc/cron.weekly/mandb runs, or you can do it yourself using 'mandb -c' as user 'man'. In the meantime, the 'whatis' and 'apropos' commands will not be able to display any output.
ca: Si no construïu ara la base de dades, aquesta serà construïda la pròxima vegada que s'executi /etc/cron.weekly/mandb, o podeu fer-ho manualment amb "mandb -c" com a usuari "man". Mentrestant, les ordres "whatis" i "apropos" no podran mostrar cap eixida.
da: Hvis du ikke opbygger databasen nu, vil den blive opbygget næste gang, /etc/cron.weekly/mandb køres, eller du kan gøre det selv med 'mandb -c' som brugeren 'man'. I mellemtiden vil kommandoerne 'whatis' og 'apropos' ikke kunne vise noget.
es: Si no construye la base de datos ahora, se hará la próxima vez que se ejecute /etc/cron.weekly/mandb, o puede hacerlo manualmente usando «mandb -c» como usuario man. Hasta entonces, las órdenes «whatis» y «apropos» no podrán mostrar nada.
fr: Si vous ne construisez pas maintenant la base de données, elle sera construite à la prochaine exécution de /etc/cron.weekly/mandb ou bien vous pourrez le faire vous-même en lançant « mandb -c » en tant que utilisateur « man ». Pendant ce temps, les commandes « whatis » et « apropos » ne pourront rien afficher.
ja: いまデータベースを構築しなければ、次回に /etc/cron.weekly/mandb が起 動した時に構築されます。「man」ユーザで「mandb -c」を実行することでも 構築できます。それまでの間、「whatis」コマンドと「apropos」コマンドは 正しく動作しません。
nl: Indien u de database nu niet opbouwt zal deze bij de volgende uitvoering van /etc/cron.weekly/mandb opgebouwd worden. U kunt de database op elk moment ook zelf (her)opbouwen door 'mandb -c' uit te voeren als de gebruiker 'man'. In de tussentijd zullen de 'whatis' en 'apropos' commando's geen uitvoer weergeven.
ru: Если вы не построите базу даных сейчас, то она будет построена потом при запуске /etc/cron.weekly/mandb, или вы можете запустить команду 'mandb -c' от имени пользователя 'man'. До этого момента команды 'whatis' и 'apropos' работать не смогут.

source: Should mandb rebuild its database now?
ca: Hauria de reconstruir ara mandb la seva base de dades?
da: Skal mandb genopbygge sin database nu?
es: ¿Quiere que mandb reconstruya su base de datos ahora?
fr: Voulez-vous reconstruire la base de données maintenant ?
ja: mandb は、いまデータベースを再構築すべきですか?
nl: mandb-database nu heropbouwen?
ru: Перестроить базу данных mandb сейчас?

source: This version of man-db is incompatible with your existing database of manual page descriptions, so that database needs to be rebuilt. This may take some time, depending on how many pages you have installed; it will happen in the background, possibly slowing down the installation of other packages. Do you want this to happen now?
ca: Aquesta versió de man-db és incompatible amb la vostra base de dades de les descripcions de les pàgines de manual, pel que aquesta base de dades necessita ser recontruida. Això pot trigar una estona, depenent de quantes pàgines de manual tingueu instal·lades; això es farà en un segon pla i possiblement alentirà la instal·lació d'altres paquets. Voleu que es faci això ara?
da: Denne version af man-db er inkompatibel med din eksisterende database med manualside-beskrivelser, så databasen skal genopbygges. Det vil tage nogen tid at opbygge en sådan, afhængigt af, hvor mange manualsider, du har installeret. Det vil ske i baggrunden, og kan midlertidigt gøre installationen af andre pakker langsommere. Vil du have, at det sker nu?
es: Esta versión de man-db es incompatible con la base de datos de descripciones de páginas de manual existente en su sistema, por lo que se debe rehacer. Puede llevar algún tiempo, dependiendo de cuántas páginas de manual haya instalado; se realizará en segundo plano, por lo que es posible que se haga más lenta la instalación de otros paquetes. ¿Quiere hacerlo ahora?
fr: Cette version de man-db est incompatible avec votre base de données actuelle des descriptions de pages et celle-ci doit être reconstruite. Selon le nombre de pages installées, cela peut prendre du temps ; comme cela se passe en arrière-plan, cela peut ralentir l'installation des autres paquets. Voulez-vous lancer maintenant le programme mandb ?
ja: man-db のこのバージョンは、いまこのマシンに存在しているマニュアルペー ジの記述のデータベースと互換性がありませんので、データベースを再構築 する必要があります。どれだけのマニュアルページをインストールしたかに 依存して、この構築には多少の時間がかかります。構築はバックグラウンド で行いますので、他のパッケージのインストール過程が遅くなるかもしれま せん。いま構築したいですか?
nl: Deze nieuwe versie van man-db is incompatibel met uw bestaande man-pagina-beschrijvingsdatabase, en dus moet deze heropgebouwd worden. Dit kan enige tijd duren, afhankelijk van hoeveel man-pagina's u geïnstalleerd heeft; dit gebeurt in de achtergrond, en kan de installatie van andere pakketten vertragen. Wilt u dat dit nu gebeurt?
ru: Эта версия man-db несовместима с имеющейся у вас базой данных описаний страниц руководств, поэтому базу данных нужно перестроить. Это может занять некоторое время, в зависимости от количества установленных у вас страниц; создание базы производится в фоновом процессе, что может замедлить установку остальных пакетов. Вас это устраивает?

source: If you do not rebuild the database now, it will be rebuilt the next time /etc/cron.weekly/mandb runs, or you can do it yourself using 'mandb -c' as user 'man'. In the meantime, the 'whatis' and 'apropos' commands will not be able to display any output.
ca: Si no reconstruïu ara la base de dades, aquesta serà reconstruïda la pròxima vegada que s'executi /etc/cron.weekly/mandb o podeu fer-ho manualment amb "mandb -c" com a usuari "man". Mentrestant, les ordres "whatis" i "apropos" no podran mostrar cap eixida.
da: Hvis du ikke opbygger databasen nu, vil den blive opbygget næste gang, /etc/cron.weekly/mandb køres, eller du kan gøre det selv med 'mandb -c' som brugeren 'man'. I mellemtiden vil kommandoerne 'whatis' og 'apropos' ikke kunne vise noget.
es: Si no reconstruye la base de datos ahora, se hará la próxima vez que se ejecute /etc/cron.weekly/mandb, o puede hacerlo manualmente usando «mandb -c» como usuario man. Hasta entonces, las órdenes «whatis» y «apropos» no podrán mostrar nada.
fr: Si vous ne construisez pas maintenant la base de données, elle sera construite à la prochaine exécution de /etc/cron.weekly/mandb ou bien vous pourrez le faire vous-même en lançant « mandb -c » en tant qu'utilisateur « man ». Pendant ce temps, les commandes « whatis » et « apropos » ne pourront rien afficher.
ja: いまデータベースを構築しなければ、次回に /etc/cron.weekly/mandb が起 動した時に構築されます。「man」ユーザで「mandb -c」を実行することでも 構築できます。それまでの間、「whatis」コマンドと「apropos」コマンドは 正しく動作しません。
nl: Indien u de database nu niet heropbouwt zal deze bij de volgende uitvoering van /etc/cron.weekly/mandb heropgebouwd worden. U kunt de database op elk moment ook zelf heropbouwen door 'mandb -c' uit te voeren als de gebruiker 'man'. In de tussentijd zullen de 'whatis' en 'apropos' commando's geen uitvoer weergeven.
ru: Если вы не построите базу даных сейчас, то она будет построена потом при запуске /etc/cron.weekly/mandb, или вы можете запустить команду 'mandb -c' от имени пользователя 'man'. До этого момента команды 'whatis' и 'apropos' работать не смогут.

source: Incompatible changes like this should happen rarely.
ca: Canvis incompatibles com aquest passen molt rarament.
da: Inkompatible ændringer som denne bør ske sjældent.
es: Los cambios incompatibles como éste sólo ocurren muy esporádicamente.
fr: De telles incompatibilités n'arrivent que rarement.
ja: 今回のように、バージョンアップに伴って互換性がなくなることは、まれに しか起こらないはずです。
nl: Incompatibele veranderingen zoals deze komen zelden voor.
ru: Несовместимые изменения наподобие этого случаются редко.
